call insert_teacher_and_create_user('Звіробійко','Олександр', 'Петрович', 'Кафедра Математики');
call insert_teacher_and_create_user('Вогняникова','Марія', 'Василівна', 'Кафедра Фізики');
call insert_teacher_and_create_user('Мрійников','Оксана', 'Ігорівна', 'Кафедра Історії');
call insert_teacher_and_create_user('Чудохвилько','Ігор', 'Володимирович', 'Кафедра Біології');
call insert_teacher_and_create_user('Блискавчикова','Тетяна', 'Вікторівна', 'Кафедра Хімії');
call insert_teacher_and_create_user('Променелісова','Олена', 'Миколаївна', 'Кафедра Економіки');
call insert_teacher_and_create_user('Сповідников','Наталія', 'Петрівна', 'Кафедра Інформатики');
call insert_teacher_and_create_user('Місяцеслідова','Андрій', 'Юрійович', 'Кафедра Філології');
call insert_teacher_and_create_user('Дивословенко','Віталій', 'Сергійович', 'Кафедра Філософії');
call insert_teacher_and_create_user('Небоскрібович','Світлана', 'Володимирівна', 'Кафедра Психології');

call insert_student_and_create_user('Казкоманова','Олексій', 'Вікторович', 'Група 1', 'вул. Шевченка 10', '0981234567');
call insert_student_and_create_user('Магістральник','Марина', 'Олександрівна', 'Група 2', 'вул. Гагаріна 5', '0979876543');
call insert_student_and_create_user('Фантастенко','Ірина', 'Олегівна', 'Група 1', 'вул. Пушкіна 15', '0661112233');
call insert_student_and_create_user('Сонячнолист','Андрій', 'Ігорович', 'Група 3', 'вул. Лесі Українки 20', '0958765432');
call insert_student_and_create_user('Відьмакова','Ольга', 'Володимирівна', 'Група 2', 'вул. Грушевського 25', '0934445556');
call insert_student_and_create_user('Шаленийпідйом','Сергій', 'Миколайович', 'Група 1', 'вул. Київська 30', '0982223334');
call insert_student_and_create_user('Загадкович','Наталія', 'Іванівна', 'Група 3', 'вул. Тарасівська 35', '0973334445');
call insert_student_and_create_user('Мрійливенко','Олена', 'Андріївна', 'Група 2', 'вул. Лермонтова 40', '0955556667');
call insert_student_and_create_user('Криловерхова','Андрій', 'Юрійович', 'Група 1', 'вул. Горького 45', '0937778889');
call insert_student_and_create_user('Вітрозір','Ірина', 'Василівна', 'Група 3', 'вул. Шевська 50', '0988889990');
call insert_student_and_create_user('Феєрверкіна','Марія', 'Петрівна', 'Група 2', 'вул. Пушкіна 55', '0979990001');
call insert_student_and_create_user('Чудовикова','Олег', 'Андрійович', 'Група 1', 'вул. Гагаріна 60', '0951112223');
call insert_student_and_create_user('Шаленоступ','Тетяна', 'Ігорівна', 'Група 3', 'вул. Лесі Українки 65', '0933334445');
call insert_student_and_create_user('Мрійницька','Андрій', 'Олександрович', 'Група 2', 'вул. Грушевського 70', '0984445556');
call insert_student_and_create_user('Зіркошукач','Наталія', 'Володимирівна', 'Група 1', 'вул. Київська 75', '0976667778');
call insert_student_and_create_user('Радіснодушна','Сергія', 'Іванівна', 'Група 3', 'вул. Тарасівська 80', '0958889990');
call insert_student_and_create_user('Волшебникова','Олена', 'Андріївна', 'Група 2', 'вул. Лермонтова 85', '0930001112');
call insert_student_and_create_user('Містерія','Андрій', 'Юрійович', 'Група 1', 'вул. Горького 90', '0982223334');
call insert_student_and_create_user('Веснянкіна','Ірина', 'Василівна', 'Група 3', 'вул. Шевська 95', '0974445556');
call insert_student_and_create_user('Драйвович','Олег', 'Петрівич', 'Група 2', 'вул. Пушкіна 100', '0957778889');
call insert_student_and_create_user('Лісоверхова','Тетяна', 'Ігорівна', 'Група 1', 'вул. Гагаріна 105', '0939990001');
call insert_student_and_create_user('Зорелюбова','Андрій', 'Олександрович', 'Група 3', 'вул. Лесі Українки 110', '0981112223');
call insert_student_and_create_user('Чародійович','Наталія', 'Володимирівна', 'Група 2', 'вул. Грушевського 115', '0973334445');
call insert_student_and_create_user('Мрійкохмар','Олег', 'Андрійович', 'Група 1', 'вул. Київська 120', '0955556667');
call insert_student_and_create_user('Фантастиченко','Ірина', 'Ігорівна', 'Група 3', 'вул. Тарасівська 125', '0937778889');
call insert_student_and_create_user('Таємниченко','Анастасія', 'Олександрівна', 'Група 3', 'вул. Пушкіна 25', '0662223344');
call insert_student_and_create_user('Пригодникова','Віталій', 'Михайлович', 'Група 2', 'вул. Лесі Українки 15', '0935556677');
call insert_student_and_create_user('Чарівникович','Євгеній', 'Анатолійович', 'Група 1', 'вул. Шевченка 20', '0977778899');
call insert_student_and_create_user('Радістьповна','Олександра', 'Володимирівна', 'Група 1', 'вул. Шевченка 10', '0981234567');
call insert_student_and_create_user('Веселосміх','Максим', 'Ігорович', 'Група 2', 'вул. Гагаріна 5', '0979876543');
    
INSERT INTO Subjects (name, description)
VALUES
    ('Комплексний аналіз', 'Вивчення комплексного аналізу та його застосування в математиці та фізиці.'),
    ('Фізика квантових явищ', 'Вивчення квантової фізики та її застосування в сучасних технологіях.'),
    ('Історія світових цивілізацій', 'Дослідження історії світових цивілізацій та їх вплив на сучасний світ.'),
    ('Біоінформатика', 'Поєднання біології та інформатики для аналізу та розуміння біологічних процесів.'),
    ('Хімічна синтезорганіка', 'Вивчення методів органічного синтезу та створення нових органічних сполук.');
    
INSERT INTO Semesters (beginning_date, end_date)
VALUES
    ('01.09.2023', '31.12.2023'),
    ('01.02.2024', '31.05.2024'),
    ('01.09.2024', '31.12.2024');
    
INSERT INTO FacultativeCourses (subject_id, teacher_id, hours, type)
VALUES
    (1, 1, 30, 'лекції'),
    (2, 2, 20, 'практика'),
    (3, 3, 40, 'лабораторні роботи'),
    (4, 4, 30, 'лекції'),
    (5, 5, 20, 'практика'),
    (1, 6, 40, 'лабораторні роботи'),
    (2, 7, 30, 'лекції'),
    (3, 8, 20, 'практика'),
    (4, 9, 40, 'лабораторні роботи'),
    (5, 10, 30, 'лекції');

INSERT INTO Enrollments (student_id, course_id)
VALUES
    (1, 1),
    (1, 2),
    (2, 3),
    (2, 4),
    (3, 5),
    (3, 6),
    (4, 7),
    (4, 8),
    (5, 9),
    (5, 10),
    (6, 1),
    (6, 3),
    (7, 2),
    (7, 4),
    (8, 5),
    (8, 7),
    (9, 6),
    (9, 8),
    (10, 9),
    (10, 10),
    (11, 1),
    (11, 5),
    (12, 2),
    (12, 6),
    (13, 3),
    (13, 7),
    (14, 4),
    (14, 8),
    (15, 5),
    (15, 9),
    (16, 6),
    (16, 10),
    (17, 1),
    (17, 4),
    (18, 2),
    (18, 7),
    (19, 3),
    (19, 8),
    (20, 4),
    (20, 9),
    (21, 6),
    (21, 10),
    (22, 1),
    (22, 3),
    (23, 2),
    (23, 5),
    (24, 3),
    (24, 7),
    (25, 4),
    (25, 8),
    (26, 5),
    (26, 9),
    (27, 6),
    (27, 10),
    (28, 1),
    (28, 5),
    (29, 2),
    (29, 6),
    (30, 3),
    (30, 7);
    
INSERT INTO Semesters_Grades (semester_id, enrollment_id, grade)
VALUES
    (1, 1, 80),
    (1, 2, 75),
    (1, 3, 90),
    (1, 4, 85),
    (1, 5, 92),
    (1, 6, 78),
    (1, 7, 87),
    (1, 8, 95),
    (1, 9, 81),
    (1, 10, 89),
    (1, 11, 83),
    (1, 12, 91),
    (1, 13, 76),
    (1, 14, 93),
    (1, 15, 79),
    (1, 16, 88),
    (1, 17, 94),
    (1, 18, 82),
    (1, 19, 77),
    (1, 20, 86),
    (1, 21, 84),
    (1, 22, 96),
    (1, 23, 74),
    (1, 24, 97),
    (1, 25, 73),
    (1, 26, 98),
    (1, 27, 72),
    (1, 28, 99),
    (1, 29, 71),
    (1, 30, 100),
    (1, 31, 80),
    (1, 32, 75),
    (1, 33, 90),
    (1, 34, 85),
    (1, 35, 92),
    (1, 36, 78),
    (1, 37, 87),
    (1, 38, 95),
    (1, 39, 81),
    (1, 40, 89),
    (1, 41, 83),
    (1, 42, 91),
    (1, 43, 76),
    (1, 44, 93),
    (1, 45, 79),
    (1, 46, 88),
    (1, 47, 94),
    (1, 48, 82),
    (1, 49, 77),
    (1, 50, 86),
    (1, 51, 84),
    (1, 52, 96),
    (1, 53, 74),
    (1, 54, 97),
    (1, 55, 73),
    (1, 56, 98),
    (1, 57, 72),
    (1, 58, 99),
    (1, 59, 71),
    (1, 60, 100),
    (2, 1, 85),
    (2, 2, 90),
    (2, 3, 77),
    (2, 4, 92),
    (2, 5, 80),
    (2, 6, 88),
    (2, 7, 83),
    (2, 8, 95),
    (2, 9, 75),
    (2, 10, 93),
    (2, 11, 79),
    (2, 12, 86),
    (2, 13, 74),
    (2, 14, 97),
    (2, 15, 72),
    (2, 16, 98),
    (2, 17, 71),
    (2, 18, 99),
    (2, 19, 73),
    (2, 20, 96),
    (2, 21, 76),
    (2, 22, 94),
    (2, 23, 78),
    (2, 24, 91),
    (2, 25, 81),
    (2, 26, 89),
    (2, 27, 87),
    (2, 28, 82),
    (2, 29, 84),
    (2, 30, 70),
    (2, 31, 85),
    (2, 32, 90),
    (2, 33, 77),
    (2, 34, 92),
    (2, 35, 80),
    (2, 36, 88),
    (2, 37, 83),
    (2, 38, 95),
    (2, 39, 75),
    (2, 40, 93),
    (2, 41, 79),
    (2, 42, 86),
    (2, 43, 74),
    (2, 44, 97),
    (2, 45, 72),
    (2, 46, 98),
    (2, 47, 71),
    (2, 48, 99),
    (2, 49, 73),
    (2, 50, 96),
    (2, 51, 76),
    (2, 52, 94),
    (2, 53, 78),
    (2, 54, 91),
    (2, 55, 81),
    (2, 56, 89),
    (2, 57, 87),
    (2, 58, 82),
    (2, 59, 84),
    (2, 60, 70);